src/cf/Catalogs/Заказчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Заказчики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроектДляОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаЗаказчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаЗаказчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаЗаказчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинИТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольИТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформацияПоЗаказчику</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СервисИТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СервисыИТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммныеПродкуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрограммныйПродукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммныеПродукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конфигурация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/БанковскиеСчетаЗаказчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчетаЗаказчиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Заказчики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ОтветственныеЛицаЗаказчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЛицаЗаказчиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Заказчики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Заказчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Параметры.Ключ.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Перед добавлением файла необходимо записать элемент справочника!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.СсылкаНаВладельца", Объект.Ссылка);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ФайлыФайл.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммныеПродкутыФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.СсылкаНаВладельца", Объект.Ссылка);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ПрограммныеПродкутыФайл.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымБПНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
		Сообщить("Внимание! Необходимо заполнить ИНН контрагента!");
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Внимание! Необходимо вначале записть элемент справочника!");
		Возврат;
	КонецЕсли;
	
	СоединениеБаза = glOLEApp81Init(,ПолучитьЗначениеКонстанты("СерверБП"), ПолучитьЗначениеКонстанты("БазаБП"),  ПолучитьЗначениеКонстанты("ПользовательБП"), ПолучитьЗначениеКонстанты("ПарольБП"));
	
	Запрос = СоединениеБаза.NewObject("Запрос");;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.НаименованиеПолное КАК ПолноеНаименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.РегистрационныйНомер КАК ОГРН,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	Контрагенты.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицо,
	|	Контрагенты.ОсновнойБанковскийСчет КАК ОсновнойБанковскийСчет
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация.Вид.Наименование = ""Юридический адрес"")
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН"		, Объект.ИНН);
	
	ВыборкаОсновная = Запрос.Выполнить().Выбрать();
	Если ВыборкаОсновная.Следующий() Тогда
		Объект.ИНН 					= ВыборкаОсновная.ИНН;
		Объект.КПП 					= ВыборкаОсновная.КПП;
		Объект.ОГРН 				= ВыборкаОсновная.ОГРН;
		Объект.ПолноеНаименование 	= ВыборкаОсновная.ПолноеНаименование;
		Объект.ЮрАдрес 				= ВыборкаОсновная.ЮрАдрес;
		
		//****************банковсикй счет
		ОсновнойБанковскийСчет = Неопределено;
		Если СоединениеБаза.ЗначениеЗаполнено(ВыборкаОсновная.ОсновнойБанковскийСчет) Тогда
			ОсновнойБанковскийСчет = ВыборкаОсновная.ОсновнойБанковскийСчет;
		Иначе
			Запрос = СоединениеБаза.NewObject("Запрос");;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	БанковскиеСчета.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
			|	И БанковскиеСчета.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", ВыборкаОсновная.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОсновнойБанковскийСчет = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;     
		
		Если СоединениеБаза.ЗначениеЗаполнено(ОсновнойБанковскийСчет) Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	БанковскийСчетЗаказчика.Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчетаЗаказчиков КАК БанковскийСчетЗаказчика
			|ГДЕ
			|	БанковскийСчетЗаказчика.Владелец = &Владелец
			|	И БанковскийСчетЗаказчика.РС ПОДОБНО &РС";
			Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
			Запрос.УстановитьПараметр("РС", "%"+СокрЛП(ОсновнойБанковскийСчет.НомерСчета)+"%");
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.БанковскийСчет = Выборка.Ссылка;
			Иначе
				НовыйБанковскийСчет 						= Справочники.БанковскиеСчетаЗаказчиков.СоздатьЭлемент();
				НовыйБанковскийСчет.Владелец				= Объект.Ссылка;
				НовыйБанковскийСчет.Наименование 			= ОсновнойБанковскийСчет.Наименование;
				НовыйБанковскийСчет.НаименованиеПолное 		= ОсновнойБанковскийСчет.Банк.Наименование;
				НовыйБанковскийСчет.БИК 					= ОсновнойБанковскийСчет.Банк.Код;
				НовыйБанковскийСчет.РС 						= ОсновнойБанковскийСчет.НомерСчета;
				НовыйБанковскийСчет.КС 						= ОсновнойБанковскийСчет.Банк.КоррСчет;
				НовыйБанковскийСчет.Записать();
				Объект.БанковскийСчет = НовыйБанковскийСчет.Ссылка;
				
			КонецЕсли;
		КонецЕсли;
		
		//****************ОсновноеКонтактноеЛицо
		
		ОсновноеКонтактноеЛицо = Неопределено;
		Если СоединениеБаза.ЗначениеЗаполнено(ВыборкаОсновная.ОсновноеКонтактноеЛицо) Тогда
			ОсновноеКонтактноеЛицо = ВыборкаОсновная.ОсновноеКонтактноеЛицо;
		Иначе
			Запрос = СоединениеБаза.NewObject("Запрос");;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактныеЛица.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛица
			|ГДЕ
			|	КонтактныеЛица.ОбъектВладелец = &ОбъектВладелец
			|	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ОбъектВладелец", ВыборкаОсновная.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОсновноеКонтактноеЛицо = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;     
		
		Если СоединениеБаза.ЗначениеЗаполнено(ОсновноеКонтактноеЛицо) Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтветственныеЛицаЗаказчиков.Ссылка
			|ИЗ
			|	Справочник.ОтветственныеЛицаЗаказчиков КАК ОтветственныеЛицаЗаказчиков
			|ГДЕ
			|	ОтветственныеЛицаЗаказчиков.Владелец = &Владелец
			|	И ОтветственныеЛицаЗаказчиков.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
			Запрос.УстановитьПараметр("Наименование", СокрЛП(ОсновноеКонтактноеЛицо.Фамилия + " " + ОсновноеКонтактноеЛицо.Имя + " " + ОсновноеКонтактноеЛицо.Отчество));
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.КонтактноеЛицо = Выборка.Ссылка;
			Иначе
				
				Запрос = СоединениеБаза.NewObject("Запрос");;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КонтактныеЛица.Ссылка КАК Ссылка,
				|	КонтактныеЛица.Наименование КАК Наименование,
				|	КонтактныеЛица.Фамилия + "" "" + КонтактныеЛица.Имя + "" "" + КонтактныеЛица.Отчество КАК ФИО,
				|	ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
				|	ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Представление, """") КАК ЭлАдрес,
				|	КонтактныеЛица.Должность КАК Должность
				|ИЗ
				|	Справочник.КонтактныеЛица КАК КонтактныеЛица
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформацияТелефон
				|		ПО КонтактныеЛица.Ссылка = КонтактныеЛицаКонтактнаяИнформацияТелефон.Ссылка
				|			И (КонтактныеЛицаКонтактнаяИнформацияТелефон.Вид.Наименование = ""Телефон мобильный"")
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформацияЭлАдрес
				|		ПО КонтактныеЛица.Ссылка = КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Ссылка
				|			И (КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Вид.Наименование = ""Email"")
				|ГДЕ
				|	КонтактныеЛица.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ОсновноеКонтактноеЛицо);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НовыйОтлвЛицо 					= Справочники.ОтветственныеЛицаЗаказчиков.СоздатьЭлемент();
					НовыйОтлвЛицо.Владелец			= Объект.Ссылка;
					НовыйОтлвЛицо.Наименование 		= Выборка.ФИО;
					НовыйОтлвЛицо.Телефон 			= Выборка.Телефон;
					НовыйОтлвЛицо.ЭлектронныйАдрес 	= Выборка.ЭлАдрес;
					НовыйОтлвЛицо.Должность 		= Выборка.Должность;
					НовыйОтлвЛицо.Записать();
					Объект.КонтактноеЛицо = НовыйОтлвЛицо.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//*************Ген директор
		ГенДиректор = Неопределено;
		Запрос = СоединениеБаза.NewObject("Запрос");;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &ОбъектВладелец
		|	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
		|	И КонтактныеЛица.Должность ПОДОБНО ""%ирект%""";
		
		Запрос.УстановитьПараметр("ОбъектВладелец", ВыборкаОсновная.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ГенДиректор = Выборка.Ссылка;
		КонецЕсли;
		
		Если СоединениеБаза.ЗначениеЗаполнено(ГенДиректор) Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтветственныеЛицаЗаказчиков.Ссылка
			|ИЗ
			|	Справочник.ОтветственныеЛицаЗаказчиков КАК ОтветственныеЛицаЗаказчиков
			|ГДЕ
			|	ОтветственныеЛицаЗаказчиков.Владелец = &Владелец
			|	И ОтветственныеЛицаЗаказчиков.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
			Запрос.УстановитьПараметр("Наименование", СокрЛП(ГенДиректор.Фамилия + " " + ГенДиректор.Имя + " " + ГенДиректор.Отчество));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Объект.ГенДиректор = Выборка.Ссылка;
			Иначе
				
				Запрос = СоединениеБаза.NewObject("Запрос");;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КонтактныеЛица.Ссылка КАК Ссылка,
				|	КонтактныеЛица.Наименование КАК Наименование,
				|	КонтактныеЛица.Фамилия + "" "" + КонтактныеЛица.Имя + "" "" + КонтактныеЛица.Отчество КАК ФИО,
				|	ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
				|	ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Представление, """") КАК ЭлАдрес,
				|	КонтактныеЛица.Должность КАК Должность
				|ИЗ
				|	Справочник.КонтактныеЛица КАК КонтактныеЛица
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформацияТелефон
				|		ПО КонтактныеЛица.Ссылка = КонтактныеЛицаКонтактнаяИнформацияТелефон.Ссылка
				|			И (КонтактныеЛицаКонтактнаяИнформацияТелефон.Вид.Наименование = ""Телефон мобильный"")
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформацияЭлАдрес
				|		ПО КонтактныеЛица.Ссылка = КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Ссылка
				|			И (КонтактныеЛицаКонтактнаяИнформацияЭлАдрес.Вид.Наименование = ""Email"")
				|ГДЕ
				|	КонтактныеЛица.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ГенДиректор);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НовыйОтлвЛицо 					= Справочники.ОтветственныеЛицаЗаказчиков.СоздатьЭлемент();
					НовыйОтлвЛицо.Владелец			= Объект.Ссылка;
					НовыйОтлвЛицо.Наименование 		= Выборка.ФИО;
					НовыйОтлвЛицо.Телефон 			= Выборка.Телефон;
					НовыйОтлвЛицо.ЭлектронныйАдрес 	= Выборка.ЭлАдрес;
					НовыйОтлвЛицо.Должность 		= Выборка.Должность;
					НовыйОтлвЛицо.Записать();
					Объект.ГенДиректор = НовыйОтлвЛицо.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымБП(Команда)
	ЗаполнитьПоДаннымБПНаСервере();
КонецПроцедуры

&НаСервере
Функция glOLEApp81Init(pFile="",pSrvr="",pRef="",pUser="",pPassword="") Экспорт
	
	Перем Стр;
	Перем Соеденение;
	
	db = Новый COMОбъект("V83.ComConnector");
	
	ДругаяБаза = "";
	
	Если pFile = "" Тогда
		Стр = "Srvr="""+pSrvr+""";Ref="""+pRef+"""";
	Иначе 
		Стр = "File="""+pFile+"""";
	КонецЕсли;
	
	Если Не ПустаяСтрока(pUser) Тогда
		Стр = Стр + ";usr=""" + pUser + """";
	КонецЕсли;
	Если Не ПустаяСтрока(pPassword) Тогда
		Стр = Стр + ";pwd=" + pPassword;
	КонецЕсли;
	
	Попытка 
		ДругаяБаза = db.Connect(Стр); //Соеденение
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ДругаяБаза;
	
КонецФункции
